[
  {
    "name": "Simple Line Chart",
    "short": "A simple time series as a line chart. A good starting point to explore Wyvis!",
    "description": "The scenario asks monitor temporal data in a simple line chart. New data arrives by default every 100ms and is varied randomly. There is no other task then to display the data. This scenario is used as a simple starting point to understand the features of Wyvis.",
    "data_types": ["Temporal"],
    "visualization_tasks": ["monitor"],
    "visualization_types": ["time series"],
    "implementations": ["D3","Highcharts", "AMCharts"]
  },
  {
    "name": "Sankey Process Diagram",
    "short": "Use a dynamic Sankey chart to visualize a business process.",
    "description": "Given is fix set of nodes and links. The weight on the links is varied over time. Create a dynamic Sankey diagram to visualize the change in the data streams between the steps of our exemplary business process.",
    "data_types": ["Temporal", "Network"],
    "visualization_tasks": ["monitor", "overview"],
    "visualization_types": ["sankey diagram"],
    "implementations": ["D3"]
  },
  {
    "name": "Filtered Time Series",
    "short": "Use cross filters and time series zoom to visualize multivariate data.",
    "description": "Let the data be weight measures of chemical samples over one year. Each data point consists of sample specification, substance identification, the associated experiment, a date and the weight. We now have multivariate, temporal data. All entries but the weight and the date are on discrete scales. Our goal is to visualize the weights of different samples, of the same substance, across different experiments, during the last month.",
    "data_types": ["Temporal", "nD/Multidimensional"],
    "visualization_tasks": ["overview", "zoom", "filter"],
    "visualization_types": ["time series"],
    "implementations": ["Highcharts"]
  },
  {
    "name": "Library Release Timeline",
    "short": "A timeline of all the libraries in the database visualizing their release years.",
    "description": "This scenario shows how to fetch JSON data using jQuery. It fetches a JSON containing all the libraries data. Visualize the release dates in a timeline and show more details about each library on demand.",
    "data_types": ["Temporal"],
    "visualization_tasks": ["overview", "details-on-demand"],
    "visualization_types": ["timeline"],
    "implementations": ["Highcharts"]
  }
]